simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
#include "calibration.h"
#include "calibration_tables.h"
#include "psoc_adc.h"

#ifndef CAL_AMUX_ADC_START
#define CAL_AMUX_ADC_START() AMux_ADC_Start()
#endif

#ifndef CAL_AMUX_ADC_SELECT
#define CAL_AMUX_ADC_SELECT(channel) AMux_ADC_Select(channel)
#endif

#ifndef CAL_AMUX_IN_START
#define CAL_AMUX_IN_START() AMux_IN_Start()
#endif

#ifndef CAL_AMUX_IN_SELECT
#define CAL_AMUX_IN_SELECT(channel) AMux_IN_Select(channel)
#endif

static PsocCalDiagHook g_cal_diag_hook = (PsocCalDiagHook)0;

void psoc_calibration_set_diag_hook(PsocCalDiagHook hook)
{
    g_cal_diag_hook = hook;
}

static void cal_diag(uint8 event, uint8 value)
{
    if (g_cal_diag_hook != (PsocCalDiagHook)0) {
        g_cal_diag_hook(event, value);
    }
}

static void cal_diag_i16(uint8 event, int32 value)
{
    uint16 u;
    if (value > 32767L) { value = 32767L; }
    if (value < -32768L) { value = -32768L; }
    u = (uint16)(int16)value;
    cal_diag(event, (uint8)(u >> 8));
    cal_diag(event, (uint8)(u & 0xFFu));
}

/* Igual que cal_diag_i16 pero sin clamping: manda los 32 bits crudos de
 * "measured" (cum_avg interno) en 4 bytes MSB-first con el mismo evento.
 * cal_diag_i16 satura a +-32767 para la telemetria historica; ese clamping
 * hace que cualquier |measured|>32767 se vea identico (siempre 32767 o
 * -32768) y oculta si el mejor punto quedo "apenas" o "muy" fuera de
 * CAL_OPERATING_RANGE_COUNTS (ver HANDOFF_CALIBRATION.md). */
static void cal_diag_i32(uint8 event, int32 value)
{
    uint32 u = (uint32)value;
    cal_diag(event, (uint8)((u >> 24) & 0xFFu));
    cal_diag(event, (uint8)((u >> 16) & 0xFFu));
    cal_diag(event, (uint8)((u >> 8) & 0xFFu));
    cal_diag(event, (uint8)(u & 0xFFu));
}

static void cal_diag_point(uint8 dac, int32 measured)
{
    cal_diag(PSOC_EVT_CAL_STAGE_DAC, dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, measured);
}

/* Reporta al ESP cada cambio de canal de AMux_IN (0=normal/entrada real,
 * 1=referencia/tierra virtual) para poder confirmar por telemetria los
 * cambios de canal durante calibracion y en los estados idle/activo de
 * main.c (ver psoc_calibration_amux_active/psoc_calibration_amux_idle). */
static void cal_amux_in_select(uint8 channel)
{
    CAL_AMUX_IN_SELECT(channel);
    cal_diag(PSOC_EVT_CAL_AMUX_IN, channel);
}

void psoc_calibration_amux_active(void)
{
    cal_amux_in_select(CAL_INPUT_NORMAL_CHANNEL);
}

void psoc_calibration_amux_idle(void)
{
    cal_amux_in_select(CAL_INPUT_REF_CHANNEL);
}

static int32 abs_counts(int32 value)
{
    return (value < 0) ? -value : value;
}

/* Ver CAL_OPERATING_RANGE_COUNTS (calibration_tables.h): +-0.5V absolutos.
 * Una medicion mas alla de esto deja al operacional fuera de rango
 * operativo, sin importar si "ok" hubiera dado 1. */
static uint8 cal_measured_out_of_range(int32 measured)
{
    return (abs_counts(measured) > CAL_OPERATING_RANGE_COUNTS) ? 1u : 0u;
}

static uint8 cal_stage_min_dac(const PsocCalStage *stage)
{
    return (stage->dac_center > stage->dac_max_change)
        ? (uint8)(stage->dac_center - stage->dac_max_change)
        : 0u;
}

static uint8 cal_stage_max_dac(const PsocCalStage *stage)
{
    uint16 max_dac = (uint16)stage->dac_center + (uint16)stage->dac_max_change;
    return (max_dac > 255u) ? 255u : (uint8)max_dac;
}

static uint8 cal_stage_clamp_dac(const PsocCalStage *stage, uint8 dac)
{
    uint8 lo = cal_stage_min_dac(stage);
    uint8 hi = cal_stage_max_dac(stage);
    if (dac < lo) { return lo; }
    if (dac > hi) { return hi; }
    return dac;
}

static uint8 cal_stage_center_dac(const PsocCalStage *stage)
{
    return cal_stage_clamp_dac(stage, stage->dac_center);
}

static uint8 cal_stage_probe_dac(const PsocCalStage *stage)
{
    uint8 center = cal_stage_center_dac(stage);
    uint8 lo = cal_stage_min_dac(stage);
    uint8 hi = cal_stage_max_dac(stage);

    if (stage->direction >= 0) {
        if ((uint16)center + (uint16)CAL_PROBE_STEP <= hi) {
            return (uint8)(center + CAL_PROBE_STEP);
        }
        if (center > lo) {
            uint8 down = (center > CAL_PROBE_STEP) ? (uint8)(center - CAL_PROBE_STEP) : lo;
            return cal_stage_clamp_dac(stage, down);
        }
    } else {
        if (center > lo) {
            uint8 down = (center > CAL_PROBE_STEP) ? (uint8)(center - CAL_PROBE_STEP) : lo;
            return cal_stage_clamp_dac(stage, down);
        }
        if ((uint16)center + (uint16)CAL_PROBE_STEP <= hi) {
            return (uint8)(center + CAL_PROBE_STEP);
        }
    }

    return (center < hi) ? hi : lo;
}

PsocCalResult g_psoc_cal_results[PSOC_CAL_MAX_STAGES];
uint8 g_psoc_cal_result_count = 0u;

#define CAL_ASYNC_EMPTY_POLL_LIMIT 2000000UL

/* Watchdog global: si la calibracion no termino en este tiempo (ticks de
 * 10 ms => 200 s), se aborta y se restauran valores seguros. Queda por
 * debajo de PSOC_CAL_ACK_TIMEOUT_MS=240000 del ESP para que el CAL_DONE
 * llegue antes de que el ESP de por perdida la respuesta. */
#define CAL_WATCHDOG_TICKS 20000UL

/* Periodo de telemetria de progreso (ticks de 10 ms => ~500 ms). */
#define CAL_PROGRESS_PERIOD_TICKS 50UL

typedef enum {
    CAL_ASYNC_IDLE = 0u,
    CAL_ASYNC_STAGE_BEGIN,
    CAL_ASYNC_MEASURE,
    CAL_ASYNC_EVAL_INIT,
    CAL_ASYNC_EVAL_PROBE,
    CAL_ASYNC_PLAN_ITER,
    CAL_ASYNC_EVAL_ITER,
    CAL_ASYNC_VERIFY_BEGIN,
    CAL_ASYNC_EVAL_VERIFY,
    CAL_ASYNC_DONE
} PsocCalAsyncState;

typedef struct {
    PsocCalAsyncState state;
    PsocCalAsyncState after_measure;
    uint8 busy;
    uint8 done;
    uint8 ok;
    uint8 stage_index;
    uint8 dac;
    uint8 lo;
    uint8 hi;
    uint8 increasing;
    uint16 iter;
    uint8 best_dac;
    int32 measured;
    int32 base_measured;
    int32 best_measured;
    int32 best_abs_error;
    uint8 candidate_count;
    uint8 candidate_dac[CAL_BEST_CANDIDATE_COUNT];
    int32 candidate_measured[CAL_BEST_CANDIDATE_COUNT];
    int32 candidate_abs_error[CAL_BEST_CANDIDATE_COUNT];
    uint8 visited_count;
    uint8 visited_pos;
    uint8 visited_dac[CAL_VISIT_HISTORY_COUNT];
    int32 acc;
    int32 cum_sum;
    int32 cum_count;
    int32 prev_avg;
    uint16 avg_count;
    uint16 discard_count;
    uint8 settle_windows;
    uint8 have_prev_avg;
    uint32 empty_polls;
    uint32 start_ticks;
    uint32 last_progress_ticks;
} PsocCalAsync;

static PsocCalAsync g_cal_async = { CAL_ASYNC_IDLE };

static void cal_async_reset_stage_memory(void)
{
    uint8 i;
    g_cal_async.best_dac = 0u;
    g_cal_async.best_measured = 0L;
    g_cal_async.best_abs_error = 0x7FFFFFFFL;
    g_cal_async.candidate_count = 0u;
    g_cal_async.visited_count = 0u;
    g_cal_async.visited_pos = 0u;
    for (i = 0u; i < CAL_BEST_CANDIDATE_COUNT; i++) {
        g_cal_async.candidate_dac[i] = 0u;
        g_cal_async.candidate_measured[i] = 0L;
        g_cal_async.candidate_abs_error[i] = 0x7FFFFFFFL;
    }
    for (i = 0u; i < CAL_VISIT_HISTORY_COUNT; i++) {
        g_cal_async.visited_dac[i] = 0u;
    }
}

static uint8 cal_async_seen_dac(uint8 dac)
{
    uint8 i;
    for (i = 0u; i < g_cal_async.visited_count; i++) {
        if (g_cal_async.visited_dac[i] == dac) {
            return 1u;
        }
    }
    return 0u;
}

static void cal_async_remember_dac(uint8 dac)
{
    if (g_cal_async.visited_count < CAL_VISIT_HISTORY_COUNT) {
        g_cal_async.visited_dac[g_cal_async.visited_count] = dac;
        g_cal_async.visited_count++;
        return;
    }
    g_cal_async.visited_dac[g_cal_async.visited_pos] = dac;
    g_cal_async.visited_pos =
        (uint8)((g_cal_async.visited_pos + 1u) % CAL_VISIT_HISTORY_COUNT);
}

static void cal_async_store_candidate(uint8 dac, int32 measured, int32 abs_error)
{
    uint8 i;
    uint8 worst_i = 0u;
    int32 worst_error = -1L;

    if (abs_error < g_cal_async.best_abs_error) {
        g_cal_async.best_abs_error = abs_error;
        g_cal_async.best_dac = dac;
        g_cal_async.best_measured = measured;
    }

    for (i = 0u; i < g_cal_async.candidate_count; i++) {
        if (g_cal_async.candidate_dac[i] == dac) {
            if (abs_error < g_cal_async.candidate_abs_error[i]) {
                g_cal_async.candidate_measured[i] = measured;
                g_cal_async.candidate_abs_error[i] = abs_error;
            }
            return;
        }
    }

    if (g_cal_async.candidate_count < CAL_BEST_CANDIDATE_COUNT) {
        i = g_cal_async.candidate_count;
        g_cal_async.candidate_count++;
        g_cal_async.candidate_dac[i] = dac;
        g_cal_async.candidate_measured[i] = measured;
        g_cal_async.candidate_abs_error[i] = abs_error;
        return;
    }

    for (i = 0u; i < CAL_BEST_CANDIDATE_COUNT; i++) {
        if (g_cal_async.candidate_abs_error[i] > worst_error) {
            worst_error = g_cal_async.candidate_abs_error[i];
            worst_i = i;
        }
    }

    if (abs_error < worst_error) {
        g_cal_async.candidate_dac[worst_i] = dac;
        g_cal_async.candidate_measured[worst_i] = measured;
        g_cal_async.candidate_abs_error[worst_i] = abs_error;
    }
}

static uint8 cal_async_record_measurement(const PsocCalStage *stage)
{
    int32 abs_error = abs_counts(stage->target_counts - g_cal_async.measured);
    uint8 seen = cal_async_seen_dac(g_cal_async.dac);

