simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    cal_async_store_candidate(g_cal_async.dac, g_cal_async.measured, abs_error);
    if (!seen) {
        cal_async_remember_dac(g_cal_async.dac);
    }
    return seen;
}

typedef enum {
    CAL_SERVO_IDLE = 0u,
    CAL_SERVO_MEASURE
} PsocCalServoState;

typedef struct {
    uint8 enabled;
    PsocCalServoState state;
    uint8 stage_index;
    uint8 dac;
    int32 acc;
    int32 cum_sum;
    int32 cum_count;
    int32 prev_avg;
    uint16 avg_count;
    uint16 discard_count;
    uint8 settle_windows;
    uint8 have_prev_avg;
    uint32 empty_polls;
    uint32 next_due_ticks;

    uint8 have_last[PSOC_CAL_MAX_STAGES];
    uint8 last_dac[PSOC_CAL_MAX_STAGES];
    int32 last_measured[PSOC_CAL_MAX_STAGES];
    uint8 have_slope[PSOC_CAL_MAX_STAGES];
    uint8 increasing[PSOC_CAL_MAX_STAGES];
    uint8 trial_active[PSOC_CAL_MAX_STAGES];
    uint8 prev_dac[PSOC_CAL_MAX_STAGES];
    int32 prev_abs_error[PSOC_CAL_MAX_STAGES];
    int8 last_dir[PSOC_CAL_MAX_STAGES];
    int32 integral[PSOC_CAL_MAX_STAGES];
} PsocCalServo;

typedef struct {
    int32 kp_num;
    int32 ki_num;
    int32 ki_div;
    int32 deadband_counts;
    uint8 fine_step;
    uint8 recovery_step;
} PsocCalServoTune;

static PsocCalServo g_cal_servo = { CAL_SERVO_ENABLE_DEFAULT };

static const PsocCalServoTune g_cal_servo_tune[PSOC_CAL_STAGE_COUNT] = {
#if PSOC_HW_CLASS == PSOC_HW_GEO
    { CAL_SERVO_KP_NUM_GEO_PGA,   CAL_SERVO_KI_NUM_GEO_PGA,   CAL_SERVO_KI_DIV_GEO_PGA,   CAL_SERVO_DEADBAND_GEO_PGA,   CAL_SERVO_FINE_STEP_GEO_PGA,   CAL_SERVO_RECOVERY_STEP_GEO_PGA },
    { CAL_SERVO_KP_NUM_GEO_BP,    CAL_SERVO_KI_NUM_GEO_BP,    CAL_SERVO_KI_DIV_GEO_BP,    CAL_SERVO_DEADBAND_GEO_BP,    CAL_SERVO_FINE_STEP_GEO_BP,    CAL_SERVO_RECOVERY_STEP_GEO_BP },
    { CAL_SERVO_KP_NUM_GEO_ADDER, CAL_SERVO_KI_NUM_GEO_ADDER, CAL_SERVO_KI_DIV_GEO_ADDER, CAL_SERVO_DEADBAND_GEO_ADDER, CAL_SERVO_FINE_STEP_GEO_ADDER, CAL_SERVO_RECOVERY_STEP_GEO_ADDER },
    { CAL_SERVO_KP_NUM_GEO_LP,    CAL_SERVO_KI_NUM_GEO_LP,    CAL_SERVO_KI_DIV_GEO_LP,    CAL_SERVO_DEADBAND_GEO_LP,    CAL_SERVO_FINE_STEP_GEO_LP,    CAL_SERVO_RECOVERY_STEP_GEO_LP },
#else
    { CAL_SERVO_KP_NUM_HAMMER_IN,  CAL_SERVO_KI_NUM_HAMMER_IN,  CAL_SERVO_KI_DIV_HAMMER_IN,  CAL_SERVO_DEADBAND_HAMMER_IN,  CAL_SERVO_FINE_STEP_HAMMER_IN,  CAL_SERVO_RECOVERY_STEP_HAMMER_IN },
    { CAL_SERVO_KP_NUM_HAMMER_PGA, CAL_SERVO_KI_NUM_HAMMER_PGA, CAL_SERVO_KI_DIV_HAMMER_PGA, CAL_SERVO_DEADBAND_HAMMER_PGA, CAL_SERVO_FINE_STEP_HAMMER_PGA, CAL_SERVO_RECOVERY_STEP_HAMMER_PGA },
    { CAL_SERVO_KP_NUM_HAMMER_LP,  CAL_SERVO_KI_NUM_HAMMER_LP,  CAL_SERVO_KI_DIV_HAMMER_LP,  CAL_SERVO_DEADBAND_HAMMER_LP,  CAL_SERVO_FINE_STEP_HAMMER_LP,  CAL_SERVO_RECOVERY_STEP_HAMMER_LP },
#endif
};

static int32 cal_servo_clip_integral(int32 value)
{
    if (value > CAL_SERVO_INTEGRAL_LIMIT) { return CAL_SERVO_INTEGRAL_LIMIT; }
    if (value < -CAL_SERVO_INTEGRAL_LIMIT) { return -CAL_SERVO_INTEGRAL_LIMIT; }
    return value;
}

static uint16 cal_servo_settle_samples(uint8 stage_index)
{
#if PSOC_HW_CLASS == PSOC_HW_GEO
    switch (stage_index) {
        case 0u: return CAL_SERVO_SETTLE_SAMPLES_GEO_PGA;
        case 1u: return CAL_SERVO_SETTLE_SAMPLES_GEO_BP;
        case 2u: return CAL_SERVO_SETTLE_SAMPLES_GEO_ADDER;
        default: return CAL_SERVO_SETTLE_SAMPLES_GEO_LP;
    }
#else
    switch (stage_index) {
        case 0u: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_IN;
        case 1u: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_PGA;
        default: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_LP;
    }
#endif
}

static uint8 cal_stage_current_dac(uint8 stage_index)
{
    if (stage_index >= g_psoc_cal_result_count) {
        return cal_stage_center_dac(&g_psoc_cal_stages[stage_index]);
    }
    return cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index],
                               g_psoc_cal_results[stage_index].final_dac);
}

static void cal_stage_write_result(uint8 stage_index, uint8 dac)
{
    if (stage_index < PSOC_CAL_STAGE_COUNT) {
        uint8 clamped = cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index], dac);
        g_psoc_cal_stages[stage_index].write(clamped);
        g_psoc_cal_results[stage_index].final_dac = clamped;
        if (g_psoc_cal_result_count < PSOC_CAL_STAGE_COUNT) {
            g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
        }
    }
}

static uint8 cal_servo_apply_measurement(uint8 stage_index, uint8 dac, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    const PsocCalServoTune *tune = &g_cal_servo_tune[stage_index];
    PsocCalResult *result = &g_psoc_cal_results[stage_index];
    int32 error = stage->target_counts - measured;
    int32 abs_error = abs_counts(error);
    int8 dir;
    uint8 step;
    int16 next;
    uint8 slope_increasing;

    result->final_measured = measured;
    result->ok = (abs_error <= stage->tolerance_counts) ? 1u : 0u;

    if (g_cal_servo.have_last[stage_index] &&
        g_cal_servo.last_dac[stage_index] != dac &&
        g_cal_servo.last_measured[stage_index] != measured) {
        slope_increasing =
            ((measured > g_cal_servo.last_measured[stage_index]) ==
             (dac > g_cal_servo.last_dac[stage_index])) ? 1u : 0u;
        g_cal_servo.increasing[stage_index] = slope_increasing;
        g_cal_servo.have_slope[stage_index] = 1u;
    }

    if (abs_error <= tune->deadband_counts) {
        g_cal_servo.integral[stage_index] /= 2L;
        g_cal_servo.trial_active[stage_index] = 0u;
        g_cal_servo.have_last[stage_index] = 1u;
        g_cal_servo.last_dac[stage_index] = dac;
        g_cal_servo.last_measured[stage_index] = measured;
        return 1u;
    }

    if (g_cal_servo.trial_active[stage_index] &&
        abs_error > (g_cal_servo.prev_abs_error[stage_index] +
                     CAL_SERVO_WORSE_HYST_COUNTS) &&
        g_cal_servo.last_dir[stage_index] != 0) {
        uint8 restore_dac = g_cal_servo.last_dac[stage_index];
        cal_stage_write_result(stage_index, restore_dac);
        result->final_measured = g_cal_servo.last_measured[stage_index];
        result->ok = (g_cal_servo.prev_abs_error[stage_index] <=
                      stage->tolerance_counts) ? 1u : 0u;
        g_cal_servo.integral[stage_index] = 0L;
        g_cal_servo.trial_active[stage_index] = 0u;
        cal_diag(PSOC_EVT_CAL_LOOP, restore_dac);
        return 1u;
    } else {
        int32 control;
        uint8 assume_increasing;

