simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
        g_cal_servo.integral[stage_index] =
            cal_servo_clip_integral(g_cal_servo.integral[stage_index] + error);
        control = (error * tune->kp_num) +
            ((g_cal_servo.integral[stage_index] * tune->ki_num) /
             ((tune->ki_div == 0L) ? 1L : tune->ki_div));
        if (control == 0L) {
            control = error;
        }

        assume_increasing = g_cal_servo.have_slope[stage_index]
            ? g_cal_servo.increasing[stage_index]
            : ((stage->direction >= 0) ? 1u : 0u);
        if (assume_increasing) {
            dir = (control > 0L) ? 1 : -1;
        } else {
            dir = (control > 0L) ? -1 : 1;
        }
    }

    step = (abs_error > CAL_OPERATING_RANGE_COUNTS)
        ? tune->recovery_step
        : tune->fine_step;
    next = (int16)dac + (int16)((int16)dir * (int16)step);
    if (next < (int16)cal_stage_min_dac(stage)) {
        next = (int16)cal_stage_min_dac(stage);
    }
    if (next > (int16)cal_stage_max_dac(stage)) {
        next = (int16)cal_stage_max_dac(stage);
    }

    g_cal_servo.have_last[stage_index] = 1u;
    g_cal_servo.last_dac[stage_index] = dac;
    g_cal_servo.last_measured[stage_index] = measured;

    if ((uint8)next != dac) {
        if (g_cal_servo.trial_active[stage_index] &&
            (uint8)next == g_cal_servo.prev_dac[stage_index]) {
            g_cal_servo.integral[stage_index] = 0L;
            g_cal_servo.trial_active[stage_index] = 0u;
            cal_diag(PSOC_EVT_CAL_LOOP, (uint8)next);
            return 1u;
        }
        g_cal_servo.prev_dac[stage_index] = dac;
        g_cal_servo.prev_abs_error[stage_index] = abs_error;
        g_cal_servo.last_dir[stage_index] = dir;
        g_cal_servo.trial_active[stage_index] = 1u;
        cal_stage_write_result(stage_index, (uint8)next);
        cal_diag(PSOC_EVT_SERVO_STEP, (uint8)next);
        return 0u;
    } else {
        g_cal_servo.trial_active[stage_index] = 0u;
        return 1u;
    }
}

static void cal_servo_measure_begin(uint8 stage_index)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];

    g_cal_servo.stage_index = stage_index;
    g_cal_servo.dac = cal_stage_current_dac(stage_index);
    g_cal_servo.acc = 0L;
    g_cal_servo.cum_sum = 0L;
    g_cal_servo.cum_count = 0L;
    g_cal_servo.prev_avg = 0L;
    g_cal_servo.avg_count = 0u;
    g_cal_servo.discard_count = cal_servo_settle_samples(stage_index);
    g_cal_servo.settle_windows = 0u;
    g_cal_servo.have_prev_avg = 0u;
    g_cal_servo.empty_polls = 0UL;

    ADC_Stop();
    cal_amux_in_select(CAL_INPUT_REF_CHANNEL);
    CAL_AMUX_ADC_SELECT(stage->adc_channel);
    ADC_Start();
    isr_DelSig_ClearPending();
    psoc_adc_clear_isr_sample();
    ADC_StartConvert();
    cal_diag(PSOC_EVT_SERVO_STAGE, stage_index);
    g_cal_servo.state = CAL_SERVO_MEASURE;
}

static uint8 cal_servo_measure_service(void)
{
    int32 sample;
    int32 cum_avg;
    uint8 stage_index = g_cal_servo.stage_index;

    if (!psoc_adc_take_isr_sample(&sample)) {
        g_cal_servo.empty_polls++;
        if (g_cal_servo.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            g_cal_servo.state = CAL_SERVO_IDLE;
            psoc_calibration_restore_capture_path();
            return 1u;
        }
        return 0u;
    }

    g_cal_servo.empty_polls = 0UL;
    if (g_cal_servo.discard_count > 0u) {
        g_cal_servo.discard_count--;
        return 0u;
    }

    g_cal_servo.acc += sample;
    g_cal_servo.avg_count++;
    if (g_cal_servo.avg_count < CAL_SERVO_AVG_N) {
        return 0u;
    }

    g_cal_servo.cum_sum += g_cal_servo.acc;
    g_cal_servo.cum_count += (int32)CAL_SERVO_AVG_N;
    g_cal_servo.acc = 0L;
    g_cal_servo.avg_count = 0u;

    cum_avg = g_cal_servo.cum_sum / g_cal_servo.cum_count;
    if (g_cal_servo.have_prev_avg &&
        abs_counts(cum_avg - g_cal_servo.prev_avg) <= CAL_SERVO_SETTLE_TOL_COUNTS) {
        uint8 locked;
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, g_cal_servo.dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, cum_avg);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, cum_avg);
        locked = cal_servo_apply_measurement(stage_index, g_cal_servo.dac, cum_avg);
        psoc_calibration_restore_capture_path();
        if (locked) {
            g_cal_servo.stage_index = (uint8)((stage_index + 1u) % PSOC_CAL_STAGE_COUNT);
        }
        g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
        g_cal_servo.state = CAL_SERVO_IDLE;
        return 1u;
    }

    g_cal_servo.prev_avg = cum_avg;
    g_cal_servo.have_prev_avg = 1u;
    g_cal_servo.settle_windows++;
    if (g_cal_servo.settle_windows >= CAL_SERVO_SETTLE_MAX_WINDOWS) {
        uint8 locked;
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, g_cal_servo.dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, cum_avg);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, cum_avg);
        locked = cal_servo_apply_measurement(stage_index, g_cal_servo.dac, cum_avg);
        psoc_calibration_restore_capture_path();
        if (locked) {
            g_cal_servo.stage_index = (uint8)((stage_index + 1u) % PSOC_CAL_STAGE_COUNT);
        }
        g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
        g_cal_servo.state = CAL_SERVO_IDLE;
        return 1u;
    }

    return 0u;
}

void psoc_calibration_start_references(void)
{
    uint8 i;

    CAL_AMUX_ADC_START();
    CAL_AMUX_IN_START();
    ADC_Stop();
    cal_amux_in_select(CAL_INPUT_NORMAL_CHANNEL);
    CAL_AMUX_ADC_SELECT(CAL_ADC_CAPTURE_CHANNEL);
    ADC_Start();
    ADC_StopConvert();

#if PSOC_HW_CLASS == PSOC_HW_GEO
    VDAC_ref_PGA_Start();
    VDAC_ref_BP_Start();
    VDAC_Ref_Adder_Start();
    VDAC_ref_LP_Start();
#else
    HAMMER_VDAC_IN_START();
    VDAC_PGA_Start();
    VDAC_LP_Start();
#endif

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
}

/* Deja el AMux_ADC en el canal de captura (GEO_LP) pero con AMux_IN en la
 * referencia/tierra virtual (CAL_INPUT_REF_CHANNEL): este es el estado IDLE,
 * en el que el ADC queda mirando GEO_LP vs. referencia para poder verificar
 * en cualquier momento si el front-end sigue calibrado. main.c
 * (psoc_set_amux_active, en psoc_arm/psoc_start_now) cambia a
 * CAL_INPUT_NORMAL_CHANNEL justo antes de armar/capturar, y vuelve a llamar
 * a esta funcion (vía psoc_set_amux_idle) al terminar. */
void psoc_calibration_restore_capture_path(void)
{
    ADC_Stop();
    cal_amux_in_select(CAL_INPUT_REF_CHANNEL);
    CAL_AMUX_ADC_SELECT(CAL_ADC_CAPTURE_CHANNEL);
    ADC_Start();
    ADC_StopConvert();
}

void psoc_calibration_reset_references(void)
{
    uint8 i;

    ADC_Stop();
    cal_amux_in_select(CAL_INPUT_REF_CHANNEL);
    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
    psoc_calibration_restore_capture_path();
}

void psoc_calibration_servo_enable(uint8 enable)
{
    g_cal_servo.enabled = enable ? 1u : 0u;
    if (!g_cal_servo.enabled) {
        psoc_calibration_servo_abort();
    } else {
        g_cal_servo.next_due_ticks = psoc_now_ticks();
    }
}

uint8 psoc_calibration_servo_enabled(void)
{
    return g_cal_servo.enabled;
}

void psoc_calibration_servo_abort(void)
{
    if (g_cal_servo.state == CAL_SERVO_MEASURE) {
        ADC_StopConvert();
        psoc_calibration_restore_capture_path();
    }
    g_cal_servo.state = CAL_SERVO_IDLE;
    g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
}

uint8 psoc_calibration_servo_service(void)
{
    if (!g_cal_servo.enabled || g_cal_async.busy) {
        return 0u;
    }

