simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    if (g_cal_servo.state == CAL_SERVO_IDLE) {
        uint32 now = psoc_now_ticks();
        if ((int32)(now - g_cal_servo.next_due_ticks) >= 0) {
            cal_servo_measure_begin(g_cal_servo.stage_index);
        }
        return 0u;
    }

    return cal_servo_measure_service();
}

static void async_measure_begin(uint8 dac, PsocCalAsyncState after_measure,
                                uint16 settle_samples, uint8 write_dac)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];

    g_cal_async.dac = dac;
    g_cal_async.after_measure = after_measure;
    g_cal_async.acc = 0L;
    g_cal_async.cum_sum = 0L;
    g_cal_async.cum_count = 0L;
    g_cal_async.avg_count = 0u;
    g_cal_async.discard_count = settle_samples;
    g_cal_async.settle_windows = 0u;
    g_cal_async.have_prev_avg = 0u;
    g_cal_async.prev_avg = 0L;
    g_cal_async.empty_polls = 0UL;
    if (write_dac) {
        stage->write(dac);
    }
    psoc_adc_clear_isr_sample();
    g_cal_async.state = CAL_ASYNC_MEASURE;
}

/* Mide promediando ACUMULATIVAMENTE: cada ventana de avg_n muestras se suma
 * al total (cum_sum/cum_count) en vez de descartarse, y "measured" es siempre
 * ese promedio acumulado de baja-ruido (nunca el de una sola ventana). Se
 * sigue acumulando hasta que el promedio acumulado deje de moverse mas de
 * CAL_SETTLE_TOL_COUNTS de una ventana a la siguiente, o hasta
 * CAL_SETTLE_MAX_WINDOWS como limite de seguridad -- en ese caso tambien se
 * devuelve el promedio acumulado (no la ultima ventana), que ya es mucho mas
 * estable que una ventana sola. Esto evita que el ruido de una sola medicion
 * "convenza" a la busqueda binaria de que un punto es mejor de lo que es
 * (corregido 2026-06-14, ver HANDOFF: la busqueda terminaba sobre-ajustando
 * al ruido y saturando GEO_LP). */
static uint8 async_measure_service(void)
{
    int32 sample;
    int32 cum_avg;
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];

    if (!psoc_adc_take_isr_sample(&sample)) {
        g_cal_async.empty_polls++;
        if (g_cal_async.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            g_cal_async.measured = 0x7FFFL;
            cal_diag_point(g_cal_async.dac, g_cal_async.measured);
            g_cal_async.state = g_cal_async.after_measure;
            return 1u;
        }
        return 0u;
    }

    g_cal_async.empty_polls = 0UL;
    if (g_cal_async.discard_count > 0u) {
        g_cal_async.discard_count--;
        return 0u;
    }

    g_cal_async.acc += sample;
    g_cal_async.avg_count++;
    if (g_cal_async.avg_count < stage->avg_n) {
        return 0u;
    }

    g_cal_async.cum_sum += g_cal_async.acc;
    g_cal_async.cum_count += (int32)stage->avg_n;
    g_cal_async.acc = 0L;
    g_cal_async.avg_count = 0u;

    cum_avg = g_cal_async.cum_sum / g_cal_async.cum_count;
    g_cal_async.measured = cum_avg;

    if (g_cal_async.have_prev_avg &&
        (abs_counts(cum_avg - g_cal_async.prev_avg) <= CAL_SETTLE_TOL_COUNTS)) {
        cal_diag_point(g_cal_async.dac, g_cal_async.measured);
        g_cal_async.state = g_cal_async.after_measure;
        return 1u;
    }

    g_cal_async.prev_avg = cum_avg;
    g_cal_async.have_prev_avg = 1u;
    g_cal_async.settle_windows++;
    if (g_cal_async.settle_windows >= CAL_SETTLE_MAX_WINDOWS) {
        cal_diag_point(g_cal_async.dac, g_cal_async.measured);
        g_cal_async.state = g_cal_async.after_measure;
        return 1u;
    }

    return 0u;
}

static void async_finish_stage(uint8 ok)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    uint8 final_dac = g_cal_async.best_dac;
    int32 final_measured = g_cal_async.best_measured;

    if (g_cal_async.best_abs_error <= stage->tolerance_counts) {
        ok = 1u;
    }

    if (cal_measured_out_of_range(final_measured)) {
        /* No volver al default: si no hay punto perfecto, igual dejamos el
         * mejor candidato real encontrado y lo marcamos como no OK. */
        ok = 0u;

        if (g_cal_async.stage_index == (PSOC_CAL_STAGE_COUNT - 1u)) {
            /* La ultima etapa alimenta al canal de captura del ADC; avisar si
             * incluso el mejor candidato quedo fuera del rango operativo. */
            cal_diag(PSOC_EVT_CAL_LP_BAD, (uint8)g_cal_async.stage_index);
        }
    }

    final_dac = cal_stage_clamp_dac(stage, final_dac);
    stage->write(final_dac);
    result->final_dac = final_dac;
    result->final_measured = final_measured;
    result->ok = ok;
    if (!ok) {
        g_cal_async.ok = 0u;
    }
    cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
    cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

#if CAL_FAIL_FAST_ON_STAGE_FAIL
    if (!ok) {
        g_cal_async.stage_index = PSOC_CAL_STAGE_COUNT;
        g_cal_async.state = CAL_ASYNC_VERIFY_BEGIN;
        return;
    }
#endif

    g_cal_async.stage_index++;
    g_cal_async.state = CAL_ASYNC_STAGE_BEGIN;
}

/* Aborta la calibracion por timeout (CAL_WATCHDOG_TICKS sin terminar).
 * Las etapas ya finalizadas (indices < stage_index durante la busqueda)
 * conservan su mejor valor encontrado; la etapa en curso y las que faltan
 * se fuerzan al centro nominal de cada etapa. Durante la
 * verificacion (todas las etapas ya calibradas) no se toca ningun DAC. */
static void cal_async_abort_watchdog(void)
{
    uint8 i;
    uint8 verify_phase = (g_cal_async.state == CAL_ASYNC_VERIFY_BEGIN ||
                           g_cal_async.state == CAL_ASYNC_EVAL_VERIFY) ? 1u : 0u;

    if (!verify_phase) {
        for (i = g_cal_async.stage_index; i < PSOC_CAL_STAGE_COUNT; i++) {
            uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
            g_psoc_cal_stages[i].write(center);
            g_psoc_cal_results[i].final_dac = center;
            g_psoc_cal_results[i].final_measured = 0L;
            g_psoc_cal_results[i].ok = 0u;
        }
    }
    g_cal_async.ok = 0u;
    cal_diag(PSOC_EVT_CAL_WATCHDOG, g_cal_async.stage_index);

    ADC_Stop();
    psoc_calibration_restore_capture_path();
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
    isr_SyncIn_ClearPending();
    isr_SyncIn_Enable();
    g_cal_async.busy = 0u;
    g_cal_async.done = 1u;
    g_cal_async.state = CAL_ASYNC_DONE;
}

uint8 psoc_calibration_start_async(void)
{
    if (g_cal_async.busy) {
        return 0u;
    }

    isr_SyncIn_Disable();
    ADC_Stop();
    psoc_adc_select_capture_config();
    ADC_Stop();
    cal_amux_in_select(CAL_INPUT_REF_CHANNEL);

