simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
    g_cal_async.busy = 1u;
    g_cal_async.done = 0u;
    g_cal_async.ok = 1u;
    g_cal_async.stage_index = 0u;
    g_cal_async.state = CAL_ASYNC_STAGE_BEGIN;
    g_cal_async.start_ticks = psoc_now_ticks();
    g_cal_async.last_progress_ticks = g_cal_async.start_ticks;
    return 1u;
}

uint8 psoc_calibration_async_busy(void)
{
    return g_cal_async.busy;
}

uint8 psoc_calibration_async_result_ok(void)
{
#if PSOC_HW_CLASS == PSOC_HW_GEO
    /* En GEO el criterio de uso para captura es la salida final (GEO_LP).
     * Las etapas intermedias se reportan igual como diagnostico, pero si la
     * cascada termina centrada no queremos marcar la calibracion completa como
     * fallida en el ESP/web. */
    if (g_psoc_cal_result_count >= PSOC_CAL_STAGE_COUNT) {
        return g_psoc_cal_results[PSOC_CAL_STAGE_COUNT - 1u].ok;
    }
#endif
    return g_cal_async.ok;
}

uint8 psoc_calibration_service_async(void)
{
    const PsocCalStage *stage;
    int32 abs_error;

    if (!g_cal_async.busy) {
        return 0u;
    }

    {
        uint32 now = psoc_now_ticks();
        if ((now - g_cal_async.start_ticks) >= CAL_WATCHDOG_TICKS) {
            cal_async_abort_watchdog();
            return 1u;
        }
        if ((now - g_cal_async.last_progress_ticks) >= CAL_PROGRESS_PERIOD_TICKS) {
            g_cal_async.last_progress_ticks = now;
            cal_diag(PSOC_EVT_CAL_PROGRESS, g_cal_async.stage_index);
        }
    }

    switch (g_cal_async.state) {
        case CAL_ASYNC_STAGE_BEGIN:
            if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
                g_cal_async.stage_index = 0u;
                g_cal_async.state = CAL_ASYNC_VERIFY_BEGIN;
                break;
            }
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            cal_async_reset_stage_memory();
            cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, g_cal_async.stage_index);
            ADC_Stop();
            CAL_AMUX_ADC_SELECT(stage->adc_channel);
            ADC_Start();
            isr_DelSig_ClearPending();
            ADC_StartConvert();
            async_measure_begin(cal_stage_center_dac(stage), CAL_ASYNC_EVAL_INIT,
                                stage->settle_samples, 1u);
            break;

        case CAL_ASYNC_MEASURE:
            (void)async_measure_service();
            break;

        case CAL_ASYNC_EVAL_INIT:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            g_cal_async.base_measured = g_cal_async.measured;
            (void)cal_async_record_measurement(stage);
            if (g_cal_async.best_abs_error <= stage->tolerance_counts) {
                async_finish_stage(1u);
                break;
            }
            g_cal_async.dac = cal_stage_probe_dac(stage);
            if (g_cal_async.dac == g_cal_async.best_dac) {
                async_finish_stage(0u);
                break;
            }
            async_measure_begin(g_cal_async.dac, CAL_ASYNC_EVAL_PROBE,
                                stage->settle_samples, 1u);
            break;

        case CAL_ASYNC_EVAL_PROBE:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (cal_async_record_measurement(stage)) {
                cal_diag(PSOC_EVT_CAL_LOOP, g_cal_async.dac);
                async_finish_stage((g_cal_async.best_abs_error <= stage->tolerance_counts) ? 1u : 0u);
                break;
            }
            if (g_cal_async.best_abs_error <= stage->tolerance_counts) {
                async_finish_stage(1u);
                break;
            }
            if (g_cal_async.measured == g_cal_async.base_measured) {
                g_cal_async.increasing = (stage->direction >= 0) ? 1u : 0u;
            } else {
                g_cal_async.increasing =
                    ((g_cal_async.measured > g_cal_async.base_measured) ==
                     (g_cal_async.dac > cal_stage_center_dac(stage))) ? 1u : 0u;
            }
            g_cal_async.lo = cal_stage_min_dac(stage);
            g_cal_async.hi = cal_stage_max_dac(stage);
            g_cal_async.iter = 0u;
            g_cal_async.state = CAL_ASYNC_PLAN_ITER;
            break;

        case CAL_ASYNC_PLAN_ITER:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (g_cal_async.iter >= stage->max_iter) {
                async_finish_stage(0u);
                break;
            }
            {
                uint8 go_up = g_cal_async.increasing
                    ? ((g_cal_async.measured < stage->target_counts) ? 1u : 0u)
                    : ((g_cal_async.measured > stage->target_counts) ? 1u : 0u);
                uint8 next_dac;

                if (go_up) {
                    if (g_cal_async.dac >= cal_stage_max_dac(stage)) {
                        async_finish_stage(0u);
                        break;
                    }
                    g_cal_async.lo = (uint8)(g_cal_async.dac + 1u);
                } else {
                    if (g_cal_async.dac <= cal_stage_min_dac(stage)) {
                        async_finish_stage(0u);
                        break;
                    }
                    g_cal_async.hi = (uint8)(g_cal_async.dac - 1u);
                }
                if (g_cal_async.lo > g_cal_async.hi) {
                    async_finish_stage(0u);
                    break;
                }
                next_dac = (uint8)(g_cal_async.lo + ((g_cal_async.hi - g_cal_async.lo) / 2u));
                next_dac = cal_stage_clamp_dac(stage, next_dac);
                if (next_dac == g_cal_async.dac) {
                    async_finish_stage(0u);
                    break;
                }
                g_cal_async.iter++;
                async_measure_begin(next_dac, CAL_ASYNC_EVAL_ITER,
                                    stage->settle_samples, 1u);
            }
            break;

        case CAL_ASYNC_EVAL_ITER:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (cal_async_record_measurement(stage)) {
                cal_diag(PSOC_EVT_CAL_LOOP, g_cal_async.dac);
                async_finish_stage((g_cal_async.best_abs_error <= stage->tolerance_counts) ? 1u : 0u);
                break;
            }
            if (g_cal_async.best_abs_error <= stage->tolerance_counts) {
                async_finish_stage(1u);
            } else {
                g_cal_async.state = CAL_ASYNC_PLAN_ITER;
            }
            break;

        case CAL_ASYNC_VERIFY_BEGIN:
            if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
                ADC_Stop();
                psoc_calibration_restore_capture_path();
#if defined(SYNC_IN_INTSTAT)
                (void)SYNC_IN_ClearInterrupt();
#endif
                isr_SyncIn_ClearPending();
                isr_SyncIn_Enable();
                g_cal_async.busy = 0u;
                g_cal_async.done = 1u;
                g_cal_async.state = CAL_ASYNC_DONE;
                return 1u;
            }
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            cal_diag(PSOC_EVT_CAL_VERIFY_BEGIN, g_cal_async.stage_index);
            ADC_Stop();
            CAL_AMUX_ADC_SELECT(stage->adc_channel);
            ADC_Start();
            isr_DelSig_ClearPending();
            ADC_StartConvert();
            async_measure_begin(g_psoc_cal_results[g_cal_async.stage_index].final_dac,
                                CAL_ASYNC_EVAL_VERIFY,
                                stage->verify_settle_samples,
                                0u);
            break;

        case CAL_ASYNC_EVAL_VERIFY:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            {
                PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
                uint8 verify_ok;

                result->final_measured = g_cal_async.measured;
                abs_error = abs_counts(stage->target_counts - g_cal_async.measured);
                verify_ok = (abs_error <= stage->tolerance_counts) ? 1u : 0u;
                result->ok = (uint8)(result->ok && verify_ok);
                if (!verify_ok) {
                    g_cal_async.ok = 0u;
                }
                cal_diag(PSOC_EVT_CAL_VERIFY_OK, verify_ok);
                g_cal_async.stage_index++;
                g_cal_async.state = CAL_ASYNC_VERIFY_BEGIN;
            }
            break;

        default:
            break;
    }

    return 0u;
}
